[[[{"icon":"∫1dx","subjectId":"01417111","name":"Calculus 1","difficultLevel":"QUITE_HARD","credit":3,"finish":false,"detail":"ลิมิตและความต่อเนื่อง\n อนุพันธ์และการประยุกต์\n เทคนิคการอินทิเกรต","previous":[],"next":[]},{"icon":"0101","subjectId":"01418114","name":"Introduction to computer science","difficultLevel":"QUITE_EASY","credit":2,"finish":false,"detail":"พัฒนาการของคอมพิวเตอร์\nการแทนข้อมูลในคอมพิวเตอร์\nระบบจานวน องค์ประกอบของฮาร์ดแวร์คอมพิวเตอร์\nตัววัดสมรรถนะของคอมพิวเตอร์ ซอฟต์แวร์ระบบ\nตัวแปลภาษาและภาษาการโปรแกรม การแก้ปัญหา\nการออกแบบและพัฒนาขั้นตอนวิธี\nเทคนิคการโปรแกรมแบบโครงสร้าง\nความซับซ้อนในระบบคอมพิวเตอร์\nการจัดองค์การของระบบคอมพิวเตอร์\nการตั้งชื่อ สถาปัตยกรรมไคลเอนต์-เซิร์ฟเวอร์\nการทาเสมือน สมรรถนะ เครือข่ายคอมพิวเตอร\n ความทนทานต่อความผิดพลาด\nภาวะครบหน่วย ความต้องกัน\nความมั่นคงของสารสนเทศ\nระบบคอมพิวเตอร์แบบขนานและกระจาย\nการประยุกต์ระบบคอมพิวเตอร์ในปัจจุบัน\nจริยธรรมทางคอมพิวเตอร์","previous":[],"next":[]},{"icon":"KU","subjectId":"01999111","name":"Knowledge of the land","difficultLevel":"EASY","credit":2,"finish":false,"detail":"ประวัติ เอกลักษณ์และอัตลักษณ์ของมหาวิทยาลัยเกษตรศาสตร์ \nศาสตร์แห่งแผ่นดินเพื่อความกินดีอยู่ดีของชาติ \nการเรียนรู้คนต้นแบบ การสำนึกในความเป็น \nพลเมืองไทยพลเมืองโลก \nการเสริมสร้างและพัฒนาทักษะในการเรียนรู้และการทำงาน \nสู่เป้าหมายภายใต้บริบทความสำนึกดี มุ่งมั่น สร้างสรรค์ สามัคคี","previous":[],"next":[]},{"icon":".py","subjectId":"01418113","name":"Fundamental Programing","difficultLevel":"MEDIUM","credit":3,"finish":false,"detail":"แนวคิดพื้นฐานทางเทคโนโลยีคอมพิวเตอร์และสารสนเทศ \nลักษณะเฉพาะและส่วนประกอบของระบบคอมพิวเตอร์ \nเครือข่ายคอมพิวเตอร์ อินเทอร์เน็ตและเวิลด์ไวด์เว็บ \nการประยุกต์คอมพิวเตอร์ หลักการพัฒนาระบบสารสนเทศ \nความมั่นคงและภาวะส่วนตัว จริยธรรมทางคอมพิวเตอร์ ","previous":[],"next":[]},{"icon":"IC_","subjectId":"01418131","name":"Digital computer logic","difficultLevel":"MEDIUM","credit":3,"finish":false,"detail":"การออกแบบวงจรตรรกะเบื้องต้น\nการแทนข้อมูลและสารสนเทศโดยสัญญาณดิจิทัล \nการลงรหัส การแทนตัวเลขและการคานวณ \nสถาปัตยกรรมคอมพิวเตอร์ ","previous":[],"next":[]},{"icon":"Eng","subjectId":"01355112","name":"English xxxxxx","difficultLevel":"ANY","credit":3,"finish":false,"detail":"ภาษาอังกฤษทั่วไป","previous":[],"next":[]}],[{"icon":"∫2dx","subjectId":"01417112","name":"Calculus 2","difficultLevel":"QUITE_HARD","credit":3,"finish":false,"detail":"พื้นผิวกำลังสอง อนุพันธ์ย่อย\nอินทิกรัลหลายชั้น สมการเชิงอนุพันธ์เบื้องต้น","previous":[],"next":[]},{"icon":"C/C+","subjectId":"01418113","name":"Computer Programming","difficultLevel":"MEDIUM","credit":3,"finish":false,"detail":"การโปรแกรมด้วยภาษาระดับสูง\nข้อความสั่งรับเข้า/ส่งออก ตัวแปร ข้อความสั่งเงื่อนไข\nฟังก์ชัน การกาหนดสาระสาคัญเชิงกระบวนงาน\nการทดสอบหน่วยย่อย การโปรแกรมเชิงฟังก์ชัน\nการปรากฏซ้า ข้อความสั่งวนซ้า\nโครงสร้างข้อมูลพื้นฐาน การกาหนดสาระสาคัญของข้อมูล\nการโปรแกรมเชิงวัตถุ คลาส ส่วนต่อประสานและการทาให้เกิดผล\nการรับทอด ภาวะพหุสัณฐาน การรับทอดแบบพหุคูณ และมิกซ์อิน ","previous":[],"next":[]},{"icon":"O(n)","subjectId":"01418132","name":"Fundamentals of Computing","difficultLevel":"QUITE_HARD","credit":3,"finish":false,"detail":"ทฤษฎีการคานวณเชิงวิยุต ความน่าจะเป็นและสถิติ\nการทาให้เกิดผลและการประยุกต์ในวิทยาการคอมพิวเตอร์ ","previous":[],"next":[]},{"icon":"Sprt","subjectId":"01175XXX","name":"Sport","difficultLevel":"ANY","credit":1,"finish":false,"detail":"เรียนตามที่เลือก","previous":[],"next":[]}]],[[{"icon":"[R]","subjectId":"01417322","name":"Introductory Linear Algebra","difficultLevel":"QUITE_HARD","credit":3,"finish":false,"detail":"ปริภูมิเวกเตอร์ การแปลงเชิงเส้นและเมตริกซ์\nระบบของสมการเชิงเส้น ค่าเฉพาะ เวกเตอร์เฉพาะ\nการทำให้เป็นแนวทแยงมุม การประยุกต์","previous":[],"next":[]},{"icon":"java","subjectId":"01418211","name":"Software Contruction","difficultLevel":"QUITE_HARD","credit":3,"finish":false,"detail":"การโปรแกรมด้วยภาษาเชิงวัตถุที่มีชนิดแบบคงที่\nชนิด วัตถุ คลาส คลาสย่อย ส่วนต่อประสาน คลาสเชิงนามธรรม\nสิ่งผิดปกติ อรรถศาสตร์การเรียกเมธอด ลาดับชั้นของชนิด\nข้อกาหนดของซอฟต์แวร์ ตัวยืนยงในการแทนค่า\nการแยกคู่ แผนภาพการขึ้นต่อกันระหว่างโมดูล แผนภาพเชิงพฤติกรรม\nการรีแฟกเตอร์ แบบรูปการออกแบบ หลักการออกแบบเชิงวัตถุ\nการโปรแกรมเชิงเหตุการณ์ การโปรแกรมในภาวะพร้อมกัน ","previous":[],"next":[]},{"icon":"Data","subjectId":"01418231","name":"Data Structures","difficultLevel":"QUITE_HARD","credit":3,"finish":false,"detail":"โครงสร้างข้อมูล โครงสร้างแฟ้ม และการประมวลผลแฟ้ม\nขั้นตอนวิธีสาหรับใช้งานรายการ กองซ้อน แถวคอย ต้นไม้และกราฟ","previous":[],"next":[]},{"icon":"∑x/n","subjectId":"01422111","name":"Principles of Statistics","difficultLevel":"MEDIUM","credit":3,"finish":false,"detail":"ตัววัดต าแหน่งที่   ตัววัดค่ากลาง  ตัววัดการกระจาย \nตัวแปรสุ่ม  และการแจกแจงความน่าจะเป็นของตัวแปรสุ่ม  การแจกแจงทวินาม\nารแจกแจงปัวส์ซง การแจกแจงปกติ\nการแจกแจงตัวอย่าง  สถิติอนุมานส าหรับประชากรเดียวและสอง\nประชากร  การวิเคราะห์ข้อมูลจ านวนนับ  การวิเคราะห์ความแปรปรวนแบบทางเดียว\nการวิเคราะห์การถดถอยเชิงเส้นแบบง่าย","previous":[],"next":[]}],[{"icon":"DB","subjectId":"01418211","name":"Fundamentals of Database Systems","difficultLevel":"HARD","credit":3,"finish":false,"detail":"แนวคิดเกี่ยวกับฐานข้อมูลเบื้องต้น\nเป้าหมายของระบบจัดการฐานข้อมูล\nความไม่พึ่งพิงของข้อมูล บูรณภาพและความเชื่อถือได้\nการจัดองค์การเชิงตรรกะและเชิงกายภาพ\nเค้าร่างและเค้าร่างย่อย ตัวแบบข้อมูลเชิงลาดับชั้น\nเชิงข่ายงาน และเชิงสัมพันธ์ บรรทัดฐานข้อมูล\nภาษานิยามข้อมูลพจนานุกรมข้อมูล\nเครื่องช่วยตอบข้อซักถาม\nการจัดแฟ้มข้อมูล ความปลอดภัยของแฟ้มข้อมูล ","previous":[],"next":[]},{"icon":"n^2","subjectId":"01418232","name":"Algorithms Design and Analysis","difficultLevel":"HARD","credit":3,"finish":false,"detail":"แนวคิดพื้นฐานของขั้นตอนวิธี\nการวิเคราะห์ขั้นตอนวิธีในเชิงคณิตศาสตร์\nการวิเคราะห์ขั้นตอนวิธีการเรียงลาดับและการค้นหา\nเทคนิคเชิงขั้นตอนวิธี วิธีการออกแบบขั้นตอนวิธี ","previous":[],"next":[]},{"icon":"0001","subjectId":"01418233","name":"Algorithm Design and Analysis","difficultLevel":"HARD","credit":4,"finish":false,"detail":"โครงสร้างของภาษาแอสเซมบลี\nเทคนิคการกาหนดเลขที่อยู่\nแฟ้มข้อมูลสาหรับรับเข้าและส่งออก\nการแบ่งส่วนของโปรแกรมและการเชื่อมโยง\nการสร้างโปรแกรมภาษาแอสเซมบลี\nลักษณะเฉพาะของสถาปัตยกรรมคอมพิวเตอร์\nผลที่มีต่อการออกแบบและสมรรถนะของระบบ\nภาวะถ่วงดุลระหว่างราคาต่อสมรรถนะ\nการออกแบบชุดคาสั่ง ตัวประมวลผลกลาง\nระบบรับส่งข้อมูล การทางานแบบสายท่อ\nเวกเตอร์และสถาปัตยกรรมแบบริกส์ สถาปัตยกรรมแบบขนาน ","previous":[],"next":[]}]],[[{"icon":"Sys","subjectId":"01418321","name":"System Analysis and Design","difficultLevel":"HARD","credit":3,"finish":false,"detail":"ขั้นตอนวิเคราะห์เบื้องต้น เครื่องมือในการวิเคราะห์ระบบ\nผังระบบงาน ตารางการตัดสินและต้นไม้การตัดสิน\nการศึกษาความเป็นไปได้ของปัญหา\nการวิเคราะห์ความคุ้มค่าในการลงทุน นาเข้า \nส่งออกและการออกแบบ\nการออกแบบวิธีการประมวลผลด้วยคอมพิวเตอร์\nการทาเอกสาร การนาไปใช้และการประเมินผล\nการพิสูจน์ การออกแบบ กรณีศึกษา ","previous":[],"next":[]},{"icon":"OS","subjectId":"01418331","name":"Operating Systems","difficultLevel":"QUITE_EASY","credit":4,"finish":false,"detail":"พัฒนาการของสถาปัตยกรรมคอมพิวเตอร์และระบบปฏิบัติการ\nโครงสร้างระบบปฏิบัติการ กระบวนการและสายโยงใย\nการจัดกาหนดการ การติดตาย\nลาดับขั้นของหน่วยความจา การจัดการหน่วยความจา\nหน่วยความจาเสมือน การจัดการระบบแฟ้ม\nการจัดการระบบรับเข้าและส่งออก\nความมั่นคง การป้องกัน ระบบปฏิบัติการแบบกระจาย ","previous":[],"next":[]},{"icon":"Intl","subjectId":"01418341","name":"Computer Application in Linear Optimization and Network Analysis","difficultLevel":"MEDIUM","credit":3,"finish":false,"detail":"การโปรแกรมขั้นตอนวิธีสาหรับการหาค่าเหมาะที่สุดเชิงเส้น\nวิธีซิมเพล็กซ์ และวิธีซิมเพล็กซ์แบบปรับปรุง\nการวิเคราะห์เครือข่าย เทคนิคการประเมินค่าและควบคุมโครงการ\nระเบียบวิธีวิถีวิกฤต การโปรแกรมสาหรับทฤษฎีเกม ","previous":[],"next":[]},{"icon":"Semi","subjectId":"01418497","name":"Seminar","difficultLevel":"HARD","credit":1,"finish":false,"detail":"การนาเสนอและอภิปรายหัวข้อที่น่าสนใจทางวิทยาการคอมพิวเตอร์ ในระดับปริญญาตรี ","previous":[],"next":[]}],[{"icon":"Secu","subjectId":"01418322","name":"Computer System and Communication Network Security","difficultLevel":"MEDIUM","credit":3,"finish":false,"detail":"เทคนิคการเข้ารหัส เทคนิคการพิสูจน์ตัวจริง\nการบริหารความมั่นคง\nประเด็นทางกฎหมายและจริยธรรมในระบบความมั่นคงของคอมพิวเตอร์และเครือข่ายการสื่อสาร","previous":[],"next":[]},{"icon":"...","subjectId":"01418334","name":"Compiler Techniques","difficultLevel":"HARD","credit":2,"finish":false,"detail":"ตัวแปลโปรแกรมและโปรแกรมแปลภาษา เฟสของตัวแปลโปรแกรม\nสัญกรณ์และแนวคิดของภาษาและไวยากรณ์\nการวิเคราะห์ศัพท์ ต้นไม้แจงส่วนและการแปลง\nความกากวม เทคนิคการแจงส่วน\nตารางสัญลักษณ์ การแทนระหว่างกลาง\nการวิเคราะห์ความหมายและการก่อกาเนิดรหัส ","previous":[],"next":[]},{"icon":"a-\u003eb","subjectId":"01418333","name":"Automata Theory","difficultLevel":"MEDIUM","credit":2,"finish":false,"detail":"แนวคิดเรื่องภาวะจากัด เครื่องรับรู้ ข้อความปรกติ\nสมบัติปิด เครื่องจักรชนิดลาดับ และเครื่องสื่อนาภาวะจากัด\nการหาภาวะต่าสุด ไวยากรณ์ของภาษารูปนัย\nภาวะที่เอื้อต่อการคานวณ และเครื่องจักรทัวริง ","previous":[],"next":[]},{"icon":"...","subjectId":"01418334","name":"Compiler Techniques","difficultLevel":"HARD","credit":2,"finish":false,"detail":"ตัวแปลโปรแกรมและโปรแกรมแปลภาษา เฟสของตัวแปลโปรแกรม\nสัญกรณ์และแนวคิดของภาษาและไวยากรณ์\nการวิเคราะห์ศัพท์ ต้นไม้แจงส่วนและการแปลง\nความกากวม เทคนิคการแจงส่วน\nตารางสัญลักษณ์ การแทนระหว่างกลาง\nการวิเคราะห์ความหมายและการก่อกาเนิดรหัส ","previous":[],"next":[]}]],[[{"icon":"Co","subjectId":"01418490","name":"Cooperative Education","difficultLevel":"HARD","credit":6,"finish":false,"detail":"การปฏิบัติงานในลักษณะพนักงานชั่วคราว\nตามโครงงานที่ได้รับมอบหมายตลอดจนการจัดทารายงานและการนาเสนอ","previous":[],"next":[]}],[{"icon":"CS","subjectId":"01418499","name":"Computer Science Project","difficultLevel":"HARD","credit":3,"finish":false,"detail":"โครงงานที่น่าสนใจในแขนงต่างๆ ของวิทยาการคอมพิวเตอร์","previous":[],"next":[]}]]]
